# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. DataFrame can be considered as a bunch of Series objects put together to share the same index.

In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn
np.random.seed(101)

In [16]:
df = pd.DataFrame(randn(5,4), index = ['A','B','C','D','E'], columns = ['X','Y','Z','W'])
df

          X         Y         Z         W
A  1.131029  0.498600  1.179022  1.322684
B  1.852155 -0.892172  0.616861 -1.121822
C  1.652070  0.196925  0.103214 -0.147370
D  1.131284  1.085839  0.449486 -0.002963
E -0.648177 -0.956150  1.610461  1.319618

In [17]:
df_another = pd.DataFrame(randn(5,4), index = 'A B C D E'.split(), columns = 'W X Y Z'.split())
df_another

          W         X         Y         Z
A -0.363704  1.081731  1.775652  0.435743
B  1.194999  1.076547 -0.981770 -1.765463
C -0.758436 -0.454696  1.297617 -0.825378
D  0.251915  0.518763  0.587968 -0.148194
E -0.876702  0.792750  0.539118  0.669774

## Selection and Indexing

Grab data from dataframe

In [19]:
df['W']

A    1.322684
B   -1.121822
C   -0.147370
D   -0.002963
E    1.319618
Name: W, dtype: float64

In [20]:
# Passing a list of column names
df[['W', 'Y']]

          W         Y
A  1.322684  0.498600
B -1.121822 -0.892172
C -0.147370  0.196925
D -0.002963  1.085839
E  1.319618 -0.956150

In [21]:
# SQL syntax
df.W

A    1.322684
B   -1.121822
C   -0.147370
D   -0.002963
E    1.319618
Name: W, dtype: float64

In [22]:
# Colums are series
type(df['W'])

pandas.core.series.Series

In [23]:
# Creating a new column
df['New'] = df['X'] = df['Y']

In [24]:
df['New']

A    0.498600
B   -0.892172
C    0.196925
D    1.085839
E   -0.956150
Name: New, dtype: float64

In [26]:
df.drop('New', axis = 1)

          X         Y         Z         W
A  0.498600  0.498600  1.179022  1.322684
B -0.892172 -0.892172  0.616861 -1.121822
C  0.196925  0.196925  0.103214 -0.147370
D  1.085839  1.085839  0.449486 -0.002963
E -0.956150 -0.956150  1.610461  1.319618

In [27]:
df

          X         Y         Z         W       New
A  0.498600  0.498600  1.179022  1.322684  0.498600
B -0.892172 -0.892172  0.616861 -1.121822 -0.892172
C  0.196925  0.196925  0.103214 -0.147370  0.196925
D  1.085839  1.085839  0.449486 -0.002963  1.085839
E -0.956150 -0.956150  1.610461  1.319618 -0.956150

In [28]:
# To completly remove the dataframe
df.drop('New', axis = 1 , inplace = True)

In [29]:
df

          X         Y         Z         W
A  0.498600  0.498600  1.179022  1.322684
B -0.892172 -0.892172  0.616861 -1.121822
C  0.196925  0.196925  0.103214 -0.147370
D  1.085839  1.085839  0.449486 -0.002963
E -0.956150 -0.956150  1.610461  1.319618

In [30]:
# Rows drop
df.drop('E', axis = 0)

          X         Y         Z         W
A  0.498600  0.498600  1.179022  1.322684
B -0.892172 -0.892172  0.616861 -1.121822
C  0.196925  0.196925  0.103214 -0.147370
D  1.085839  1.085839  0.449486 -0.002963

In [34]:
# Selecting rows
# Selecting rows using loc

df.loc['C']

X    0.196925
Y    0.196925
Z    0.103214
W   -0.147370
Name: C, dtype: float64

In [35]:
# Or select based off of position instead of label
df.iloc[2]

X    0.196925
Y    0.196925
Z    0.103214
W   -0.147370
Name: C, dtype: float64

In [36]:
# Selecting subsets
df.loc['B','Y']

-0.8921719817718508

In [37]:
df.loc[['A','B'], ['W','Y']]

          W         Y
A  1.322684  0.498600
B -1.121822 -0.892172

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation

In [39]:
df

          X         Y         Z         W
A  0.498600  0.498600  1.179022  1.322684
B -0.892172 -0.892172  0.616861 -1.121822
C  0.196925  0.196925  0.103214 -0.147370
D  1.085839  1.085839  0.449486 -0.002963
E -0.956150 -0.956150  1.610461  1.319618

In [40]:
df > 0

       X      Y     Z      W
A   True   True  True   True
B  False  False  True  False
C   True   True  True  False
D   True   True  True  False
E  False  False  True   True

In [41]:
df[df>0]

          X         Y         Z         W
A  0.498600  0.498600  1.179022  1.322684
B       NaN       NaN  0.616861       NaN
C  0.196925  0.196925  0.103214       NaN
D  1.085839  1.085839  0.449486       NaN
E       NaN       NaN  1.610461  1.319618

In [42]:
df[df['W'] > 0]

         X        Y         Z         W
A  0.49860  0.49860  1.179022  1.322684
E -0.95615 -0.95615  1.610461  1.319618

In [46]:
df[df['W']>0]['Y']

A    0.49860
E   -0.95615
Name: Y, dtype: float64

In [47]:
df[df['W']> 0][['Y','X']]

         Y        X
A  0.49860  0.49860
E -0.95615 -0.95615

In [49]:
# For two conditions use | and & with parenthesis

In [53]:
df[(df['W']>0) & (df['Y'] > 0)]

        X       Y         Z         W
A  0.4986  0.4986  1.179022  1.322684

## More Index Details

Resetting the index or setting it something else

In [54]:
df

          X         Y         Z         W
A  0.498600  0.498600  1.179022  1.322684
B -0.892172 -0.892172  0.616861 -1.121822
C  0.196925  0.196925  0.103214 -0.147370
D  1.085839  1.085839  0.449486 -0.002963
E -0.956150 -0.956150  1.610461  1.319618

In [55]:
# Reset to default 0,1...n index
df.reset_index()

  index         X         Y         Z         W
0     A  0.498600  0.498600  1.179022  1.322684
1     B -0.892172 -0.892172  0.616861 -1.121822
2     C  0.196925  0.196925  0.103214 -0.147370
3     D  1.085839  1.085839  0.449486 -0.002963
4     E -0.956150 -0.956150  1.610461  1.319618

In [56]:
newind = 'CA NR OX CO DY'.split()

In [57]:
df['States'] = newind

In [60]:
df

          X         Y         Z         W States
A  0.498600  0.498600  1.179022  1.322684     CA
B -0.892172 -0.892172  0.616861 -1.121822     NR
C  0.196925  0.196925  0.103214 -0.147370     OX
D  1.085839  1.085839  0.449486 -0.002963     CO
E -0.956150 -0.956150  1.610461  1.319618     DY

In [62]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [63]:
df.columns

Index(['X', 'Y', 'Z', 'W', 'States'], dtype='object')

In [64]:
df.set_index('States')

               X         Y         Z         W
States
CA      0.498600  0.498600  1.179022  1.322684
NR     -0.892172 -0.892172  0.616861 -1.121822
OX      0.196925  0.196925  0.103214 -0.147370
CO      1.085839  1.085839  0.449486 -0.002963
DY     -0.956150 -0.956150  1.610461  1.319618

In [66]:
df

          X         Y         Z         W States
A  0.498600  0.498600  1.179022  1.322684     CA
B -0.892172 -0.892172  0.616861 -1.121822     NR
C  0.196925  0.196925  0.103214 -0.147370     OX
D  1.085839  1.085839  0.449486 -0.002963     CO
E -0.956150 -0.956150  1.610461  1.319618     DY

In [67]:
df.set_index('States',inplace = True)

In [68]:
df

               X         Y         Z         W
States
CA      0.498600  0.498600  1.179022  1.322684
NR     -0.892172 -0.892172  0.616861 -1.121822
OX      0.196925  0.196925  0.103214 -0.147370
CO      1.085839  1.085839  0.449486 -0.002963
DY     -0.956150 -0.956150  1.610461  1.319618

## Multi-Index and Index Hierarchy

First create  Multi-Indexed DataFrame

In [71]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [72]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [73]:
df = pd.DataFrame(np.random.randn(6,2), index= hier_index, columns = ['A', 'B'])

In [74]:
df

             A         B
G1 1 -1.270484 -0.446181
   2  0.779475  0.479900
   3 -0.960697 -2.002399
G2 1 -1.263599 -0.696232
   2 -1.148220  1.607435
   3 -1.226870  1.405532

 For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [75]:
df.loc['G1']

          A         B
1 -1.270484 -0.446181
2  0.779475  0.479900
3 -0.960697 -2.002399

In [76]:
df.loc['G1'].loc[1]

A   -1.270484
B   -0.446181
Name: 1, dtype: float64

In [77]:
df.index.names

FrozenList([None, None])

In [78]:
df.index.names = ['Group', 'Name']

In [79]:
df

                   A         B
Group Name
G1    1    -1.270484 -0.446181
      2     0.779475  0.479900
      3    -0.960697 -2.002399
G2    1    -1.263599 -0.696232
      2    -1.148220  1.607435
      3    -1.226870  1.405532

In [80]:
df.loc['G1']

             A         B
Name
1    -1.270484 -0.446181
2     0.779475  0.479900
3    -0.960697 -2.002399

In [82]:
df.xs('G1')

             A         B
Name
1    -1.270484 -0.446181
2     0.779475  0.479900
3    -0.960697 -2.002399

In [83]:
df.xs(['G1',1])

A   -1.270484
B   -0.446181
Name: (G1, 1), dtype: float64

In [86]:
df.xs(1, level = 'Name')

              A         B
Group
G1    -1.270484 -0.446181
G2    -1.263599 -0.696232

In [87]:
# End